#language: ru
@test
Функционал: тестовый

  @test1
  Сценарий: тест
    И открываем сайт
    И находим кнопку Войти
    И вводим логин
    И вводим пароль и авторизируемся
    И проверяем авторизацию
    И выбираем случайную тему
    И находим и жмем кнопку Ответить
    И пишем комментарий
    И проверяем наличие комментария
    И переходим во вкладку Темы
    И выбираем снова случайную тему
    И опять находим и жмем кнопку Ответить
    И пишем еще один комментарий
    И проверяем наличие нового комментария
    И переходим обратно во вкладку Темы