#language: ru
@test
Функционал: тестовый

  @test1
  Сценарий: тест
    И открываем сайт
    И нажимаем кнопку Войти
    И находим поле Имя Пользователя и вводим логин
    И находим поле Пароль и вводим пароль
    И нажимаем кнопку Войти2
    И проверяем авторизацию
    И выбираем случайную тему
    И нажимаем кнопку Ответить
    И находим текстовое поле и вводим текст
    И нажимаем кнопку Отправить ответ
    И проверяем что ответ опубликован
    И переходим на вкладку Темы
    И повторяем шаги



